app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First post"], ["content", "Post content"], ["user_id", 1], ["created_at", "2017-06-22 18:23:03.364209"], ["updated_at", "2017-06-22 18:23:03.364209"]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]